{
    "what is your name": ["My name is ChatBot.", "I am your friendly chatbot!!"],
    "how are you": ["I'm doing great, thank you!", "I'm just a program, but I'm functioning perfectly!"],
    "what can you do": ["I can answer questions.", "I can chat with you and provide information.", "I'm here to assist you in any way I can!"],
    "what is the capital of france": ["The capital of France is Paris.", "Paris is the capital of France."],
    "who is the president of the united states": ["The current president of the United States is Joe Biden.", "Joe Biden is the current U.S. president."],
    "what is the speed of light": ["The speed of light is approximately 299,792 kilometers per second.", "Light travels at about 300,000 km/s in a vacuum."],
    "what is the largest planet": ["Jupiter is the largest planet in our solar system.", "The largest planet in our solar system is Jupiter."],
    "who wrote romeo and juliet": ["Romeo and Juliet was written by William Shakespeare.", "William Shakespeare wrote Romeo and Juliet."],
    "what is the boiling point of water": ["The boiling point of water is 100°C (212°F) at sea level.", "Water boils at 100 degrees Celsius under normal atmospheric pressure."],
    "how many continents are there": ["There are seven continents on Earth.", "Earth has seven continents: Africa, Antarctica, Asia, Europe, North America, Oceania, and South America."],
    "what is the tallest mountain": ["Mount Everest is the tallest mountain in the world.", "The highest mountain on Earth is Mount Everest, standing at 8,848.86 meters."],
    "who discovered gravity": ["Gravity was discovered by Sir Isaac Newton.", "Isaac Newton is credited with discovering gravity."],
    "what is the square root of 16": ["The square root of 16 is 4.", "4 is the square root of 16."],
    "who painted the mona lisa": ["The Mona Lisa was painted by Leonardo da Vinci.", "Leonardo da Vinci is the artist of the Mona Lisa."],
    "what is the currency of japan": ["The currency of Japan is the Yen.", "Japan uses the Yen as its currency."],
    "what is the smallest country": ["The smallest country in the world is Vatican City.", "Vatican City is the smallest country, both in area and population."],
    "who invented the telephone": ["The telephone was invented by Alexander Graham Bell.", "Alexander Graham Bell is credited with inventing the telephone."],
    "what is the fastest animal": ["The fastest land animal is the cheetah.", "Cheetahs can run up to speeds of 70 miles per hour."],
    "what is the most spoken language": ["The most spoken language in the world is English.", "English is widely regarded as the most spoken language globally."],
    "how many hours are in a day": ["There are 24 hours in a day.", "A day has 24 hours."],
    "what is the chemical symbol for water": ["The chemical symbol for water is H₂O.", "Water is represented by the formula H₂O."],
    "what is the largest ocean": ["The Pacific Ocean is the largest ocean on Earth.", "Earth's largest ocean is the Pacific Ocean."],
    "who is known as the father of computers": ["Charles Babbage is known as the father of computers.", "The father of computers is Charles Babbage."],
    "what is the longest river": ["The Nile River is often considered the longest river in the world.", "Some claim the Amazon River is longer, but traditionally, the Nile is recognized as the longest."],
    "what is pi": ["Pi is a mathematical constant approximately equal to 3.14159.", "The value of Pi is roughly 3.14, and it represents the ratio of a circle's circumference to its diameter."],
    "where is the lecturing hall": ["The lecturing hall is in Building A.", "You can find the lecturing hall in Building A."],
    "where is lecturing hall xxx": ["The lecturing hall is in Building A.", "You can find the lecturing hall in Building A."],
    "what is the schedule for math class": ["The math class is scheduled at 10:00 AM every Monday and Wednesday."],
    "how to start a fitness routine?": "Here's a comprehensive guide to start your fitness journey:\n\n1. Initial Assessment:\n   - Begin with a thorough health assessment\n   - Consult your doctor if needed\n\n2. Starting Schedule:\n   - Start with 2-3 sessions per week\n   - Focus on basic exercises like walking, light jogging, or bodyweight movements\n\n3. Balanced Routine:\n   - Cardio: Begin with 15-20 minutes sessions\n   - Strength Training: Start with squats, push-ups, and planks\n\n4. Important Tips:\n   - Always warm up and cool down\n   - Stay hydrated\n   - Maintain a healthy diet\n\n5. Progress:\n   - Track your improvements\n   - Gradually increase intensity\n   - Be consistent and patient - lasting results take time",  
    "what is docker?": ["Docker is a platform for developing, shipping, and running applications in containers. It provides the ability to package and run applications in isolated environments called containers. These containers include everything needed to run the application: code, runtime, system tools, and libraries."],
    "how do i reach lecturing hall xxx": ["The lecturing hall is in Building A.", "You can find the lecturing hall in Building A."]
}